# Sets arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications"

cask "dbeaver-community"
cask "google-chrome"
cask "obsidian"

tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "pulumi/tap"
tap "shopify/shopify"
tap "weaveworks/tap"

brew "zstd"
brew "argocd"
brew "openssl@1.1"
brew "python@3.11"
brew "docutils"
brew "awscli"
brew "cmake"
brew "fzf"
brew "gnuplot"
brew "libevent"
brew "p11-kit"
brew "unbound"
brew "graphviz"
brew "grpcurl"
brew "helm"
brew "helmfile"
brew "jq"
brew "openjdk"
brew "zookeeper"
brew "kafka"
brew "kcat"
brew "krb5"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "libpq", link: true
brew "libssh"
brew "linkerd"
brew "maven"
brew "pdm"
brew "postgresql@14", link: false
brew "virtualenv"
brew "pre-commit"
brew "protobuf"
brew "pyenv"
brew "python@3.10"
brew "qemu"
brew "sops"
brew "step"
brew "stern"
brew "thefuck"
brew "tilt"
brew "yq"
brew "heroku/brew/heroku"
brew "pulumi/tap/pulumi"
brew "shopify/shopify/ejson"
brew "shopify/shopify/ejson2env"
brew "weaveworks/tap/eksctl"

# VSCode Extensions

vscode "bierner.markdown-mermaid"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "formulahendry.terminal"
vscode "golang.go"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cpptools"
vscode "Prisma.prisma"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "samverschueren.ava"
vscode "tamasfe.even-better-toml"
vscode "tilt-dev.tiltfile"
vscode "vadimcn.vscode-lldb"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"
